* 2017
** 2017-07 July
*** 2017-07-21 Friday
**** AMZN Put Spread
     |-------+----+------+------------------+------+-------|
     | Long  |  1 | AMZN | <2017-07-21 Fri> |  930 | Put   |
     | Short | -1 | AMZN | <2017-07-21 Fri> |  935 | Put   |
     |-------+----+------+------------------+------+-------|
     |       |    |      | <2017-06-08 Thu> | 0.51 | Trade |
     |-------+----+------+------------------+------+-------|
     | Total |    |      |                  | 0.51 |       |
     |-------+----+------+------------------+------+-------|
     #+TBLFM: @>$5=vsum(@II..III);%.2f
**** EWZ Iron Condor
     |-------+----+-----+------------------+------+-------|
     | Long  |  1 | EWZ | <2017-07-21 Fri> |   33 | Put   |
     | Short | -1 | EWZ | <2017-07-21 Fri> |   35 | Put   |
     | Short | -1 | EWZ | <2017-07-21 Fri> |   45 | Call  |
     | Long  |  1 | EWZ | <2017-07-21 Fri> |   47 | Call  |
     |-------+----+-----+------------------+------+-------|
     |       |    |     | <2017-05-16 Tue> | 0.45 | Trade |
     |-------+----+-----+------------------+------+-------|
     | Total |    |     |                  | 0.45 |       |
     |-------+----+-----+------------------+------+-------|
     #+TBLFM: @>$5=vsum(@II..III);%.2f
**** FB Iron Condor
     |-------+----+----+------------------+------+-------|
     | Long  |  1 | FB | <2017-07-21 Fri> |  135 | Put   |
     | Short | -1 | FB | <2017-07-21 Fri> |  140 | Put   |
     | Short | -1 | FB | <2017-07-21 Fri> |  160 | Call  |
     | Long  |  1 | FB | <2017-07-21 Fri> |  165 | Call  |
     |-------+----+----+------------------+------+-------|
     |       |    |    | <2017-05-24 Wed> | 1.18 | Trade |
     |-------+----+----+------------------+------+-------|
     | Total |    |    |                  | 1.18 |       |
     |-------+----+----+------------------+------+-------|
     #+TBLFM: @>$5=vsum(@II..III);%.2f
**** KRE Iron Condor
     |-------+----+-----+------------------+------+-------|
     | Long  |  1 | KRE | <2017-07-21 Fri> |   48 | Put   |
     | Short | -1 | KRE | <2017-07-21 Fri> |   50 | Put   |
     | Short | -1 | KRE | <2017-07-21 Fri> |   55 | Call  |
     | Long  |  1 | KRE | <2017-07-21 Fri> |   57 | Call  |
     |-------+----+-----+------------------+------+-------|
     |       |    |     | <2017-06-02 Fri> | 0.68 | Trade |
     |-------+----+-----+------------------+------+-------|
     | Total |    |     |                  | 0.68 |       |
     |-------+----+-----+------------------+------+-------|
     #+TBLFM: @>$5=vsum(@II..III);%.2f
**** NFLX Put
     |-------+----+------+------------------+--------+--------------------------------|
     | Short | -1 | NFLX | <2017-07-21 Fri> |    155 | Put                            |
     |-------+----+------+------------------+--------+--------------------------------|
     |       |    |      | <2017-04-19 Wed> |   1.70 | Trade                          |
     |       |    |      | <2017-04-26 Wed> |   0.87 | Roll up put 130->142           |
     |       |    |      | <2017-05-01 Mon> |   1.24 | Roll up put 142->150           |
     |       |    |      | <2017-05-08 Mon> |   2.45 | Roll MAY->JUN                  |
     |       |    |      | <2017-05-09 Tue> |  -0.26 | roll up long put 115->135      |
     |       |    |      | <2017-05-10 Wed> |   4.25 | Roll up put 150->160           |
     |       |    |      | <2017-06-01 Thu> | -10.50 | Buy back call spread           |
     |       |    |      | <2017-06-21 Wed> |  -0.26 | Roll put spread to 155 JUL Put |
     |-------+----+------+------------------+--------+--------------------------------|
     | Total |    |      |                  |  -0.51 |                                |
     |-------+----+------+------------------+--------+--------------------------------|
     #+TBLFM: @>$5=vsum(@II..III);%.2f
**** NVDA Put Spread
     |-------+----+------+------------------+-------+---------------|
     | Long  |  1 | NVDA | <2017-07-21 Fri> |   140 | Put           |
     | Short | -1 | NVDA | <2017-07-21 Fri> |   155 | Put           |
     |-------+----+------+------------------+-------+---------------|
     |       |    |      | <2017-05-15 Mon> |  1.00 | Trade         |
     |       |    |      | <2017-06-09 Fri> | -4.15 |               |
     |       |    |      | <2017-06-09 Fri> |  2.30 |               |
     |       |    |      | <2017-06-15 Thu> |  1.47 | Roll JUN->JUL |
     |-------+----+------+------------------+-------+---------------|
     | Total |    |      |                  |  0.62 |               |
     |-------+----+------+------------------+-------+---------------|
     #+TBLFM: @>$5=vsum(@II..III);%.2f
**** SLB Put
     |-------+----+-----+------------------+------+---------------|
     | Short | -1 | SLB | <2017-07-21 Fri> |   70 | Put           |
     |-------+----+-----+------------------+------+---------------|
     |       |    |     | <2017-04-24 Mon> | 0.92 | Trade         |
     |       |    |     | <2017-06-09 Fri> | 1.11 | Roll JUN->JUL |
     |-------+----+-----+------------------+------+---------------|
     | Total |    |     |                  | 2.03 |               |
     |-------+----+-----+------------------+------+---------------|
     #+TBLFM: @>$5=vsum(@II..III);%.2f
**** SPY Call Spread
     |-------+----+-----+------------------+-------+-------------------|
     | Short | -1 | SPY | <2017-07-21 Fri> |   239 | Call              |
     | Long  |  1 | SPY | <2017-07-21 Fri> |   245 | Call              |
     |-------+----+-----+------------------+-------+-------------------|
     |       |    |     | <2017-04-20 Thu> |  0.74 | Trade             |
     |       |    |     | <2017-06-15 Thu> | -0.16 | Close Long spread |
     |       |    |     | <2017-06-15 Thu> |  1.98 | Roll JUN->JUL     |
     |-------+----+-----+------------------+-------+-------------------|
     | Total |    |     |                  |  2.56 |                   |
     |-------+----+-----+------------------+-------+-------------------|
     #+TBLFM: @>$5=vsum(@II..III);%.2f
**** TLT Iron Condor
     |-------+----+-----+------------------+------+-------|
     | Long  |  1 | TLT | <2017-07-21 Fri> |  119 | Put   |
     | Short | -1 | TLT | <2017-07-21 Fri> |  122 | Put   |
     | Short | -1 | TLT | <2017-07-21 Fri> |  129 | Call  |
     | Long  |  1 | TLT | <2017-07-21 Fri> |  132 | Call  |
     |-------+----+-----+------------------+------+-------|
     |       |    |     | <2017-06-02 Fri> | 0.79 | Trade |
     |-------+----+-----+------------------+------+-------|
     | Total |    |     |                  | 0.79 |       |
     |-------+----+-----+------------------+------+-------|
     #+TBLFM: @>$5=vsum(@II..III);%.2f
**** V Iron Condor
     |-------+----+---+------------------+------+-------|
     | Long  |  1 | V | <2017-07-21 Fri> | 82.5 | Put   |
     | Short | -1 | V | <2017-07-21 Fri> |   85 | Put   |
     | Short | -1 | V | <2017-07-21 Fri> | 97.5 | Call  |
     | Long  |  1 | V | <2017-07-21 Fri> |  100 | Call  |
     |-------+----+---+------------------+------+-------|
     |       |    |   | <2017-05-16 Tue> | 0.77 | Trade |
     |-------+----+---+------------------+------+-------|
     | Total |    |   |                  | 0.77 |       |
     |-------+----+---+------------------+------+-------|
     #+TBLFM: @>$5=vsum(@II..III);%.2f
**** X Put
     |-------+----+---+------------------+------+---------------|
     | Short | -1 | X | <2017-07-21 Fri> |   23 | Put           |
     |-------+----+---+------------------+------+---------------|
     |       |    |   | <2017-04-26 Wed> | 0.91 | Trade         |
     |       |    |   | <2017-05-02 Tue> | 0.54 | Roll MAY->JUN |
     |       |    |   | <2017-06-08 Thu> | 0.72 | Roll JUN->JUL |
     |-------+----+---+------------------+------+---------------|
     | Total |    |   |                  | 2.17 |               |
     |-------+----+---+------------------+------+---------------|
     #+TBLFM: @>$5=vsum(@II..III);%.2f
**** XOP Jade Lizard
     |-------+----+-----+------------------+------+---------------|
     | Short | -1 | XOP | <2017-07-21 Fri> |   34 | Put           |
     | Short | -1 | XOP | <2017-07-21 Fri> |   37 | Call          |
     | Long  |  1 | XOP | <2017-07-21 Fri> |   38 | Call          |
     |-------+----+-----+------------------+------+---------------|
     |       |    |     | <2017-05-02 Tue> | 1.12 | Trade         |
     |       |    |     | <2017-06-09 Fri> | 0.50 | Roll JUN->JUL |
     |-------+----+-----+------------------+------+---------------|
     | Total |    |     |                  | 1.62 |               |
     |-------+----+-----+------------------+------+---------------|
     #+TBLFM: @>$5=vsum(@II..III);%.2f
** 2017-08 August
*** 2017-08-18 Friday
